#ifndef H_SOLVER
#define H_SOLVER

//----------------------------------------------------------------------------------------------------
//!
//! @note Содержит коды для количства корней. Количество корней - код, соотвествующий этому количеству.
//!
//-----------------------------------------------------------------------------------------------------
enum RootsCount {

    zeroRoot = 0,
    twoRoot = 1,
    oneRoot = 2,
    alotRoot = 3,
    twoSameRoot = 4

};

//------------------------------------------------------------------------------
//!
//! @note Дельта окрестность для погрешность в сравнении переменных типов double.
//!
//-------------------------------------------------------------------------------
const double delta = 1e-5; 

//-----------------------------------------------------------------
//!
//! @note Структура, содеражащая коэффициенты квадратного уравнения.
//!
//------------------------------------------------------------------
struct Coefficients {

    double a;
    double b;
    double c;
};

//-----------------------------------------------------------------
//!
//! @note Струкура, содеражащая корни уравнения и количество корней.
//
//------------------------------------------------------------------
struct SolveResult {

    double x1;
    double x2;

    RootsCount countRoots;
};

//------------------------------------------------------------------------------------------------------
//!
//! @param [in] coefficients    coefficients - структура, содержащая коэффициенты квадратного уравнения.
//! @param [in] *answer    *answer - указатель на структуру, содеражащую решение квадратного уранения.
//!
//! @note   Вызывает либо решение линейного уравнения ( solveLinear ), либо квадратного (solveSquare ).
//! Записывает в струрктуру answer корни уравнения и их количество.
//!
//------------------------------------------------------------------------------------------------------
void solveEquation( Coefficients coefficients, SolveResult* answer );

//----------------------------------------------------------------------------------------------------
//!
//! @param [in] coefficients   coefficients - структура, содержащая коэффициенты квадратного уравнения.
//! @param [in] *answer    *answer - указатель на структуру, содеражащую решение квадратного уранения.
//!
//! @note Решает квадратное уравнение, записывает в структуру answer корни уравнения и их количество.
//-----------------------------------------------------------------------------------------------------
void solveSquare( Coefficients coefficients, SolveResult* answer);

//-----------------------------------------------------------------------------------------------------
//!
//! @param [in] coefficients   coefficients - структура, содержащая коэффициенты квадратного уравнения.
//! @param [in] *answer    *answer - указатель на структуру, содеражащую решение квадратного уранения.
//!
//! @note Решает квадратное уравнение, записывает в структуру answer корни уравнения и их количество.
//!
//------------------------------------------------------------------------------------------------------
void solveLinear( Coefficients coefficients, SolveResult* answer);

#endif
