#ifndef H_TEST
#define H_TEST

#include "solver.h"

//--------------------------------------------------------------------------------------
//!
//! @note Содержит unit тесты, вызывает проверку на правильность корней и их количества.
//! Если обнаружено несовпадение - печатает о некорректности вычислений.
//!
//---------------------------------------------------------------------------------------
void test();

//--------------------------------------------------------------------------------------------------------------------
//!
//! @param [in] truResult   truResult - конструктор типа SoveResult, содержащий правильные ответы.
//! @param [in] *actualResult   *actualResult - указатль на конструктор типа SolveResult, содеражащий вычисленные ответы.
//!
//! @return 1 при совпадении корней, 0 при различии.
//!
//! @note Проверяет, совпадают ли корректные ответы и вычисленные.
//!
//---------------------------------------------------------------------------------------------------------------------- 
int testSolve( SolveResult truResult, SolveResult* actualResult );

//--------------------------------------------------------------------------------------------------------------------
//!
//! @param [in] coeff   coeff - структура типа Coefficients, содеражащая коэффициенты квадратного уравнения.
//! @param [in] truResult   truResult - структура типа SolveResult, содеражащая правильные ответы.
//! @param [in] *actualResult   *actualResult - указатель на структуру типа SolveResult, содеражащаю полученные ответы.
//!
//! @note Печатает о несовпадении решений, если оно обнаружено.
//!
//---------------------------------------------------------------------------------------------------------------------
void printFail( Coefficients coeff, SolveResult truResult, SolveResult* actualResult );

#endif
