var searchData=
[
  ['программа_20занимается_20решением_20квадратного_20уравнения_20или_20его_20частных_20случаев_0',['&lt;em&gt;Эта программа занимается решением квадратного уравнения или его частных случаев.&lt;/em&gt;',['../md__r_e_a_d_m_e.html#autotoc_md2',1,'']]],
  ['программы_1',['&lt;b&gt;Запуск программы&lt;/b&gt;',['../md__r_e_a_d_m_e.html#autotoc_md5',1,'']]],
  ['программы_20на_20компьютер_20через_20терминал_2',['&lt;b&gt;Загрузка программы на компьютер через терминал&lt;/b&gt;',['../md__r_e_a_d_m_e.html#autotoc_md3',1,'']]],
  ['проект_20нужно_3a_3',['&lt;b&gt;Чтобы скачать весь проект, нужно:&lt;/b&gt;',['../md__r_e_a_d_m_e.html#autotoc_md4',1,'']]]
];
