#ifndef H_PAINT
#define H_PAINT

#define colorInPurple "\033[35;40m"
#define colorInYellow "\033[33;40m"
#define colorInGreen "\033[32;40m"
#define colorInBlue "\033[34;40m"
#define colorInRed "\033[31;40m"
#define colorReset "\033[0m"

//--------------------------------------------------------------------------------------------------
//!
//! @param[in] color    color - константная строка, содержащая цвет, в который будет краситься текст.
//! @param[in] line     line - строка, которая будет печататься.
//! @param[in] ...      ... - необязательные параметры.
//!
//--------------------------------------------------------------------------------------------------
void colorPrintf( const char* color, const char* line ... );

//--------------------------------------------------------------------------------------------
//!
//! @param[in] color    color - макрос, который красит текст.
//! @param[in] line     line - строка, которая будет окрашиваться и печататься.
//! @param[in] cleanColor   cleanColor - макрос, который возращает печатающийся текст
//!                                      к начальному состоянию.
//!
//! @return "0" если была ошибка выделения памяти, в другом случае возращает покрашенный текст.
//!
//---------------------------------------------------------------------------------------------
const char* getColorLine( const char* color, const char* line, const char* clenColor );
#endif